Создать репозиторий на GitHub
Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод)
Снабдить репозиторий оформленным текстовым описанием решения (файл README.md)
Написать программу, решающую поставленную задачу
Использовать контроль версий в работе над этим небольшим проектом (не должно быть так, что всё залито одним коммитом, как минимум этапы 2, 3, и 4 должны быть расположены в разных коммитах)
Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

Примеры: [“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”] [“1234”, “1567”, “-2”, “computer science”] → [“-2”] [“Russia”, “Denmark”, “Kazan”] → []
ОПИСАНИЕ КОДА
Выводим сообщение для пользователя: Условия ввода значений. System.Console.Write($"Введите значения через запятую в одну строчку для использования в массиве: ")
Создаем переменную в которую вкладывается значение от пользователя.
Создаем метод CreateArray для создания исходного массива через Split.
Создаем массив прсваеваем ему значение переменной через функцию Split.
Создаем метод PrintArray для вывода массива. (Использовался только для конечного массива.)
Перебираем элементы массива через цикл For, через запятую.
Создаем метод FinalArray для создания массива согласно условиям задачи.(аписать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. )
Создаем массив, которому присваиваем значение метода CreateArray.
Создаем создаем строчную переменную, оставляем пустой String.Empty.
Через цикл For перебираем значения.
Внутри цикла for создаем цикл If и проверяем условие: "Длина значений равна или меньше трех символов.
Значения удовлетворяющие условиям вкладываем в строчную переменную.
Создаем массив строчного типа в который вкладываем переменную и используем функцию Split. Возвращаем массив return NewArray.
Выводим исходный массив и конечный.
Создаем пустой строчный массив и присваиваем значение метода CreateArray.
Выводим исходный массив System.Console.WriteLine($"Исходный массив: [{string.Join(", ", array)}]").
Вызываем метод PrintArray и выводим конечный массив.